In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('C:\\Users\\user\\Downloads\\Python Problems\\Numpy,Pandas &Visualizaation\\Files_Dataset\\Titanic-Dataset.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#SibSp- this column represents the no. of siblings/spouse onboard.
#Parch - no. of parents/children onboard.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
(df == 0).sum()

PassengerId      0
Survived       549
Pclass           0
Name             0
Sex              0
Age              0
SibSp          608
Parch          678
Ticket           0
Fare            15
Cabin            0
Embarked         0
dtype: int64

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [9]:
#how many passengers survived
df[df['Survived'] == 1].shape

(342, 12)

In [10]:
#average age of passengers who survived

survived_passenger = df[df['Survived'] == 1]
survived_passenger['Age'].mean()

28.343689655172415

In [11]:
#Average age of survived passenger by Sex

survived_passenger.groupby('Sex')['Age'].mean()

Sex
female    28.847716
male      27.276022
Name: Age, dtype: float64

In [12]:
#name of the passenger who are oldest and survived

survived_passenger[survived_passenger['Age'] == survived_passenger['Age'].max()][['Name', 'Age']].reset_index()

   index                                  Name   Age
0    630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [13]:
# name of the passenger who are youngest and survived

survived_passenger[survived_passenger['Age'] == survived_passenger['Age'].min()][['Name', 'Age']].reset_index()

   index                             Name   Age
0    803  Thomas, Master. Assad Alexander  0.42

In [14]:
df.rename(columns={'SibSp': 'Sibling/Spouse', 'Parch' : 'Parent/Children'}, inplace=True)
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,Sibling/Spouse,Parent/Children,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [15]:
#count of passenger who has survived and not survived in a table
df.groupby('Survived')['PassengerId'].count().reset_index()

   Survived  PassengerId
0         0          549
1         1          342

In [16]:
#Class wise passenger survived and not survived count

df.groupby(['Pclass','Survived'])['PassengerId'].count().reset_index(name = 'Count')

   Pclass  Survived  Count
0       1         0     80
1       1         1    136
2       2         0     97
3       2         1     87
4       3         0    372
5       3         1    119

In [17]:
# do females survived more than men in third class. 
survived_passenger_female = df[(df['Survived'] == 1) & (df['Sex'] == 'female')]

In [18]:
survived_passenger_female.groupby(['Pclass'])['PassengerId'].count().reset_index(name = 'Female_Count')

   Pclass  Female_Count
0       1            91
1       2            70
2       3            72

In [19]:
# no. of surviver having age less than 10
df[(df['Survived'] == 1) & (df['Age'] < 10)].shape

(38, 12)

In [20]:
import matplotlib.pyplot as plt
import seaborn as sns